app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "18009191_10104442700100352_1596147995_n.jpg"], ["image_updated_at", "2019-11-25 21:32:00.410441"], ["updated_at", "2019-11-25 21:32:00.602512"], ["id", 1]]