blogger/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "blah blah"], ["updated_at", "2019-11-25 04:14:06.212346"], ["id", 10]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)